alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
/*
 * Register definitions for STM32F4xx.
 *
 * Copyright (C) 2015 Dmitry Podkhvatilin, <vatilin@gmail.com>
 *
 * This file is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * You can redistribute this file and/or modify it under the terms of the GNU
 * General Public License (GPL) as published by the Free Software Foundation;
 * either version 2 of the License, or (at your discretion) any later version.
 * See the accompanying file "COPYING.txt" for more details.
 *
 * As a special exception to the GPL, permission is granted for additional
 * uses of the text contained in this file.  See the accompanying file
 * "COPY-UOS.txt" for details.
 */

typedef volatile unsigned int arm_reg_t;


#ifndef KHZ_HCLK
#define KHZ_HCLK    KHZ
#endif

#ifndef KHZ_PCLK1
#define KHZ_PCLK1   KHZ_HCLK
#endif

#ifndef KHZ_PCLK2
#define KHZ_PCLK2   KHZ_HCLK
#endif


#define ARM_SRAM_BASE       0x20000000  // Internal static memory
#define ARM_PERIPH_BASE     0x40000000  // Peripheral registers
#define ARM_SYSTEM_BASE     0xE0000000  // Core registers

#define ARM_SRAM_SIZE       (192*1024)  // Internal SRAM size

#define STM_EEPROM_BASE     0x08080000  // EEPROM base address

#include <runtime/cortex-m/io-cortex-m.h>

//
// Peripheral memory map
//
#define STM_OB_BASE             0x1FF80000
#define STM_TIM2_BASE           0x40000000
#define STM_TIM3_BASE           0x40000400
#define STM_TIM4_BASE           0x40000800
#define STM_TIM5_BASE           0x40000C00
#define STM_TIM6_BASE           0x40001000
#define STM_TIM7_BASE           0x40001400
#define STM_TIM12_BASE          0x40001800
#define STM_TIM13_BASE          0x40001C00
#define STM_TIM14_BASE          0x40002000
#define STM_LCD_BASE            0x40002400
#define STM_RTC_BKP_BASE        0x40002800
#define STM_WWDG_BASE           0x40002C00
#define STM_IWDG_BASE           0x40003000
#define STM_I2S2EXT_BASE        0x40003400
#define STM_SPI2_I2S2_BASE      0x40003800
#define STM_SPI3_I2S3_BASE      0x40003C00
#define STM_I2S3EXT_BASE        0x40004000
#define STM_USART2_BASE         0x40004400
#define STM_USART3_BASE         0x40004800
#define STM_UART4_BASE          0x40004C00
#define STM_UART5_BASE          0x40005000
#define STM_I2C1_BASE           0x40005400
#define STM_I2C2_BASE           0x40005800
#define STM_USB_DEV_FS_BASE     0x40005C00
#define STM_USB_DEV_FS_SRAM_BASE 0x40006000
#define STM_PWR_BASE            0x40007000
#define STM_DAC_BASE            0x40007400
#define STM_COMP_BASE           0x40007C00
#define STM_RI_BASE             0x40007C04
#define STM_OPAMP_BASE          0x40007C5C
#define STM_SYSCFG_BASE         0x40010000
#define STM_EXTI_BASE           0x40010400
#define STM_TIM9_BASE           0x40010800
#define STM_TIM10_BASE          0x40010C00
#define STM_TIM11_BASE          0x40011000
#define STM_ADC_BASE            0x40012400
#define STM_SDIO_BASE           0x40012C00
#define STM_SPI1_BASE           0x40013000
#define STM_USART1_BASE         0x40013800
#define STM_GPIOA_BASE          0x40020000
#define STM_GPIOB_BASE          0x40020400
#define STM_GPIOC_BASE          0x40020800
#define STM_GPIOD_BASE          0x40020C00
#define STM_GPIOE_BASE          0x40021000
#define STM_GPIOH_BASE          0x40021400 // Перепутан порядок букв
#define STM_GPIOF_BASE          0x40021800 // Сделано, как написано в RM0038
#define STM_GPIOG_BASE          0x40021C00
#define STM_CRC_BASE            0x40023000
#define STM_RCC_BASE            0x40023800
#define STM_FLASH_IFACE_BASE    0x40023C00
#define STM_BKPSRAM_BASE        0x40024000
#define STM_DMA1_BASE           0x40026000
#define STM_DMA2_BASE           0x40026400
#define STM_CRYP_BASE           0x50060000
#define STM_FSMC_BASE           0xA0000000


typedef enum
{
    IRQ_WWDG,
    IRQ_PVD,
    IRQ_TAMPER_STAMP,
    IRQ_RTC_WKUP,
    IRQ_FLASH,
    IRQ_RCC,
    IRQ_EXTI0,
    IRQ_EXTI1,
    IRQ_EXTI2,
    IRQ_EXTI3,
    IRQ_EXTI4,
    IRQ_DMA1_CHANNEL1,
    IRQ_DMA1_CHANNEL2,
    IRQ_DMA1_CHANNEL3,
    IRQ_DMA1_CHANNEL4,
    IRQ_DMA1_CHANNEL5,
    IRQ_DMA1_CHANNEL6,
    IRQ_DMA1_CHANNEL7,
    IRQ_ADC1,
    IRQ_USB_HP,
    IRQ_USB_LP,
    IRQ_DAC,
    IRQ_COMP_CA,
    IRQ_EXTI9_5,
    IRQ_LCD,
    IRQ_TIM9,
    IRQ_TIM10,
    IRQ_TIM11,
    IRQ_TIM2,
    IRQ_TIM3,
    IRQ_TIM4,
    IRQ_I2C1_EV,
    IRQ_I2C1_ER,
    IRQ_I2C2_EV,
    IRQ_I2C2_ER,
    IRQ_SPI1,
    IRQ_SPI2,
    IRQ_USART1,
    IRQ_USART2,
    IRQ_USART3,
    IRQ_EXTI15_10,
    IRQ_RTC_ALARM,
    IRQ_USB_FS_WKUP,
    IRQ_TIM6,
    IRQ_TIM7,
#if defined(STM32L1_CAT3)
    IRQ_TIM5,
    IRQ_SPI3,
    IRQ_DMA2_CHANNEL1,
    IRQ_DMA2_CHANNEL2,
    IRQ_DMA2_CHANNEL3,
    IRQ_DMA2_CHANNEL4,
    IRQ_DMA2_CHANNEL5,
    IRQ_AES,
    IRQ_COMP_ACQ,
#endif
#if defined(STM32L1_CAT4) || defined(STM32L1_CAT5) || defined(STM32L1_CAT6)
    IRQ_SDIO,
    IRQ_TIM5,
    IRQ_SPI3,
    IRQ_UART4,
    IRQ_UART5,
    IRQ_DMA2_CHANNEL1,
    IRQ_DMA2_CHANNEL2,
    IRQ_DMA2_CHANNEL3,
    IRQ_DMA2_CHANNEL4,
    IRQ_DMA2_CHANNEL5,
    IRQ_AES,
    IRQ_COMP_ACQ,
#endif
    ARCH_TIMER_IRQ,
    ARCH_INTERRUPTS
} IRQn_t;


/////////////////////////////////////////
// External interrupt/event controller
/////////////////////////////////////////
typedef struct
{
    arm_reg_t IMR;      // Interrupt mask
    arm_reg_t EMR;      // Event mask
    arm_reg_t RTSR;     // Rising edge trigger selection
    arm_reg_t FTSR;     // Falling edge trigger selection
    arm_reg_t SWIER;    // Software interrupt event
    arm_reg_t PR;       // Pending
} EXTI_t;

#define EXTI     ((EXTI_t *) STM_EXTI_BASE)

// EXTI lines
#define EXTI_GPIO(n)        (1 << (n))
#define EXTI_PVD            (1 << 16)
#define EXTI_RTC_ALARM      (1 << 17)
#define EXTI_USB_DEV_FS     (1 << 18)
#define EXTI_RTC_TAMP_TS    (1 << 19)
#define EXTI_RTC_WKUP       (1 << 20)
#define EXTI_COMP1_WKUP     (1 << 21)
#define EXTI_COMP2_WKUP     (1 << 22)
#define EXTI_CHAN_ACQ       (1 << 23)


/////////////////////////////////////////
// Power control
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Power control
    arm_reg_t CSR;      // Power control/status
} PWR_t;

#define PWR     ((PWR_t *) STM_PWR_BASE)

// CR values
#define PWR_LPRUN           (1 << 14)
#define PWR_VOS_1_8         (1 << 11)
#define PWR_VOS_1_5         (2 << 11)
#define PWR_VOS_1_2         (3 << 11)
#define PWR_VOS_MASK        (3 << 11)
#define PWR_FWU             (1 << 10)
#define PWR_ULP             (1 << 9)
#define PWR_DBP             (1 << 8)
#define PWR_PLS_1_9         (0 << 5)
#define PWR_PLS_2_1         (1 << 5)
#define PWR_PLS_2_3         (2 << 5)
#define PWR_PLS_2_5         (3 << 5)
#define PWR_PLS_2_7         (4 << 5)
#define PWR_PLS_2_9         (5 << 5)
#define PWR_PLS_3_1         (6 << 5)
#define PWR_PLS_EXT         (7 << 5)
#define PWR_PVDE            (1 << 4)
#define PWR_CSBF            (1 << 3)
#define PWR_CWUF            (1 << 2)
#define PWR_PDDS            (1 << 1)
#define PWR_LPSDSR          (1 << 0)

// CSR values
#define PWR_EWUP3           (1 << 10)
#define PWR_EWUP2           (1 << 9)
#define PWR_EWUP1           (1 << 8)
#define PWR_REGLPF          (1 << 5)
#define PWR_VOSF            (1 << 4)
#define PWR_VREFINTRDYF     (1 << 3)
#define PWR_PVDO            (1 << 2)
#define PWR_SBF             (1 << 1)
#define PWR_WUF             (1 << 0)


/////////////////////////////////////////
// Reset and clock control
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Clock control
    arm_reg_t ICSCR;    // Internal clock sources calibration
    arm_reg_t CFGR;     // Clock configuration
    arm_reg_t CIR;      // Clock interrupt
    arm_reg_t AHBRSTR;  // AHB peripheral reset
    arm_reg_t APB2RSTR; // APB2 peripheral reset
    arm_reg_t APB1RSTR; // APB1 peripheral reset
    arm_reg_t AHBENR;   // AHB peripheral clock enable
    arm_reg_t APB2ENR;  // APB2 peripheral clock enable
    arm_reg_t APB1ENR;  // APB1 peripheral clock enable
    arm_reg_t AHBLPENR; // AHB peripheral clock enable in low power mode
    arm_reg_t APB2LPENR;// APB2 peripheral clock enable in low power mode
    arm_reg_t APB1LPENR;// APB1 peripheral clock enable in low power mode
    arm_reg_t CSR;      // Clock control & status
} RCC_t;

