alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
#define RCC     ((RCC_t *) STM_RCC_BASE)

// CR values
#define RCC_RTCPRE_DIV2         (0 << 30)
#define RCC_RTCPRE_DIV4         (1 << 30)
#define RCC_RTCPRE_DIV8         (2 << 30)
#define RCC_RTCPRE_DIV16        (3 << 30)
#define RCC_CSSON               (1 << 28)
#define RCC_PLLRDY              (1 << 25)
#define RCC_PLLON               (1 << 24)
#define RCC_HSEBYP              (1 << 18)
#define RCC_HSERDY              (1 << 17)
#define RCC_HSEON               (1 << 16)
#define RCC_MSIRDY              (1 << 9)
#define RCC_MSION               (1 << 8)
#define RCC_HSIRDY              (1 << 1)
#define RCC_HSION               (1 << 0)

// ICSCR
#define RCC_MSITRIM(n)          ((n) << 24)
#define RCC_MSICAL(n)           ((n) << 16)
#define RCC_MSIRANGE_65536      (0 << 13)
#define RCC_MSIRANGE_131072     (1 << 13)
#define RCC_MSIRANGE_262144     (2 << 13)
#define RCC_MSIRANGE_524288     (3 << 13)
#define RCC_MSIRANGE_1048K      (4 << 13)
#define RCC_MSIRANGE_2097K      (5 << 13)
#define RCC_MSIRANGE_4194K      (6 << 13)
#define RCC_MSIRANGE_MASK       (7 << 13)
#define RCC_HSITRIM(n)          ((n) << 8)
#define RCC_HSICAL(n)           ((n))

// CFGR values
#define RCC_MCOPRE_NODIV        (0 << 28)
#define RCC_MCOPRE_DIV2         (1 << 28)
#define RCC_MCOPRE_DIV4         (2 << 28)
#define RCC_MCOPRE_DIV8         (3 << 28)
#define RCC_MCOPRE_DIV16        (4 << 28)
#define RCC_MCOSEL_NO_OUT       (0 << 24)
#define RCC_MCOSEL_SYSCLK       (1 << 24)
#define RCC_MCOSEL_HSI          (2 << 24)
#define RCC_MCOSEL_MSI          (3 << 24)
#define RCC_MCOSEL_HSE          (4 << 24)
#define RCC_MCOSEL_PLL          (5 << 24)
#define RCC_MCOSEL_LSI          (6 << 24)
#define RCC_MCOSEL_LSE          (7 << 24)
#define RCC_PLLDIV2             (1 << 22)
#define RCC_PLLDIV3             (2 << 22)
#define RCC_PLLDIV4             (3 << 22)
#define RCC_PLLMUL3             (0 << 18)
#define RCC_PLLMUL4             (1 << 18)
#define RCC_PLLMUL6             (2 << 18)
#define RCC_PLLMUL8             (3 << 18)
#define RCC_PLLMUL12            (4 << 18)
#define RCC_PLLMUL16            (5 << 18)
#define RCC_PLLMUL24            (6 << 18)
#define RCC_PLLMUL32            (7 << 18)
#define RCC_PLLMUL48            (8 << 18)
#define RCC_PLLSRC_HSI          (0 << 16)
#define RCC_PLLSRC_HSE          (1 << 16)
#define RCC_PPRE2_DIV(x)        ((((x) >> 1) + 3) << 11)
#define RCC_PPRE1_DIV(x)        ((((x) >> 1) + 3) << 8)
#define RCC_HPRE_DIV(x)         ((((x) >> 1) + 7) << 4)
#define RCC_SWS_MSI             (0 << 2)
#define RCC_SWS_HSI             (1 << 2)
#define RCC_SWS_HSE             (2 << 2)
#define RCC_SWS_PLL             (3 << 2)
#define RCC_SWS_MASK            (3 << 2)
#define RCC_SW_MSI              (0 << 0)
#define RCC_SW_HSI              (1 << 0)
#define RCC_SW_HSE              (2 << 0)
#define RCC_SW_PLL              (3 << 0)
#define RCC_SW_MASK             (3 << 0)

// CIR values
#define RCC_CSSC                (1 << 23)
#define RCC_LSECSSC             (1 << 22)
#define RCC_MSIRDYC             (1 << 21)
#define RCC_PLLRDYC             (1 << 20)
#define RCC_HSERDYC             (1 << 19)
#define RCC_HSIRDYC             (1 << 18)
#define RCC_LSERDYC             (1 << 17)
#define RCC_LSIRDYC             (1 << 16)
#define RCC_LSECSSIE            (1 << 14)
#define RCC_MSIRDYIE            (1 << 13)
#define RCC_PLLRDYIE            (1 << 12)
#define RCC_HSERDYIE            (1 << 11)
#define RCC_HSIRDYIE            (1 << 10)
#define RCC_LSERDYIE            (1 << 9)
#define RCC_LSIRDYIE            (1 << 8)
#define RCC_CSSF                (1 << 7)
#define RCC_LSECSSF             (1 << 6)
#define RCC_PLLI2SSDRYF         (1 << 5)
#define RCC_PLLRDYF             (1 << 4)
#define RCC_HSERDYF             (1 << 3)
#define RCC_HSIRDYF             (1 << 2)
#define RCC_LSERDYF             (1 << 1)
#define RCC_LSIRDYF             (1 << 0)

// AHBRSTR values
#define RCC_FSMCRST             (1 << 30)
#define RCC_AESRST              (1 << 27)
#define RCC_DMA2RST             (1 << 25)
#define RCC_DMA1RST             (1 << 24)
#define RCC_FLITFRST            (1 << 15)
#define RCC_CRCRST              (1 << 12)
#define RCC_GPIOGRST            (1 << 7)
#define RCC_GPIOFRST            (1 << 6)
#define RCC_GPIOHRST            (1 << 5)
#define RCC_GPIOERST            (1 << 4)
#define RCC_GPIODRST            (1 << 3)
#define RCC_GPIOCRST            (1 << 2)
#define RCC_GPIOBRST            (1 << 1)
#define RCC_GPIOARST            (1 << 0)

// APB2RSTR values
#define RCC_USART1RST           (1 << 14)
#define RCC_SPI1RST             (1 << 12)
#define RCC_SDIORST             (1 << 11)
#define RCC_ADC1RST             (1 << 9)
#define RCC_TIM11RST            (1 << 4)
#define RCC_TIM10RST            (1 << 3)
#define RCC_TIM9RST             (1 << 2)
#define RCC_SYSCFGRST           (1 << 0)

// APB1RSTR values
#define RCC_COMPRST             (1 << 31)
#define RCC_DACRST              (1 << 29)
#define RCC_PWRRST              (1 << 28)
#define RCC_USBRST              (1 << 23)
#define RCC_I2C2RST             (1 << 22)
#define RCC_I2C1RST             (1 << 21)
#define RCC_UART5RST            (1 << 20)
#define RCC_UART4RST            (1 << 19)
#define RCC_USART3RST           (1 << 18)
#define RCC_USART2RST           (1 << 17)
#define RCC_SPI3RST             (1 << 15)
#define RCC_SPI2RST             (1 << 14)
#define RCC_WWDGRST             (1 << 11)
#define RCC_LCDRST              (1 << 9)
#define RCC_TIM7RST             (1 << 5)
#define RCC_TIM6RST             (1 << 4)
#define RCC_TIM5RST             (1 << 3)
#define RCC_TIM4RST             (1 << 2)
#define RCC_TIM3RST             (1 << 1)
#define RCC_TIM2RST             (1 << 0)

// AHBENR values
#define RCC_FSMCEN              (1 << 30)
#define RCC_AESEN               (1 << 27)
#define RCC_DMA2EN              (1 << 25)
#define RCC_DMA1EN              (1 << 24)
#define RCC_FLITFEN             (1 << 15)
#define RCC_CRCEN               (1 << 12)
#define RCC_GPIOGEN             (1 << 7)
#define RCC_GPIOFEN             (1 << 6)
#define RCC_GPIOHEN             (1 << 5)
#define RCC_GPIOEEN             (1 << 4)
#define RCC_GPIODEN             (1 << 3)
#define RCC_GPIOCEN             (1 << 2)
#define RCC_GPIOBEN             (1 << 1)
#define RCC_GPIOAEN             (1 << 0)

