alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
// APB2ENR values
#define RCC_USART1EN           (1 << 14)
#define RCC_SPI1EN             (1 << 12)
#define RCC_SDIOEN             (1 << 11)
#define RCC_ADC1EN             (1 << 9)
#define RCC_TIM11EN            (1 << 4)
#define RCC_TIM10EN            (1 << 3)
#define RCC_TIM9EN             (1 << 2)
#define RCC_SYSCFGEN           (1 << 0)

// APB1ENR values
#define RCC_COMPEN             (1 << 31)
#define RCC_DACEN              (1 << 29)
#define RCC_PWREN              (1 << 28)
#define RCC_USBEN              (1 << 23)
#define RCC_I2C2EN             (1 << 22)
#define RCC_I2C1EN             (1 << 21)
#define RCC_UART5EN            (1 << 20)
#define RCC_UART4EN            (1 << 19)
#define RCC_USART3EN           (1 << 18)
#define RCC_USART2EN           (1 << 17)
#define RCC_SPI3EN             (1 << 15)
#define RCC_SPI2EN             (1 << 14)
#define RCC_WWDGEN             (1 << 11)
#define RCC_LCDEN              (1 << 9)
#define RCC_TIM7EN             (1 << 5)
#define RCC_TIM6EN             (1 << 4)
#define RCC_TIM5EN             (1 << 3)
#define RCC_TIM4EN             (1 << 2)
#define RCC_TIM3EN             (1 << 1)
#define RCC_TIM2EN             (1 << 0)

// AHBLPENR values
#define RCC_FSMCLPEN           (1 << 30)
#define RCC_AESLPEN            (1 << 27)
#define RCC_DMA2LPEN           (1 << 25)
#define RCC_DMA1LPEN           (1 << 24)
#define RCC_SRAMLPEN           (1 << 16)
#define RCC_FLITFLPEN          (1 << 15)
#define RCC_CRCLPEN            (1 << 12)
#define RCC_GPIOGLPEN          (1 << 7)
#define RCC_GPIOFLPEN          (1 << 6)
#define RCC_GPIOHLPEN          (1 << 5)
#define RCC_GPIOELPEN          (1 << 4)
#define RCC_GPIODLPEN          (1 << 3)
#define RCC_GPIOCLPEN          (1 << 2)
#define RCC_GPIOBLPEN          (1 << 1)
#define RCC_GPIOALPEN          (1 << 0)

// APB2LPENR values
#define RCC_USART1LPEN         (1 << 14)
#define RCC_SPI1LPEN           (1 << 12)
#define RCC_SDIOLPEN           (1 << 11)
#define RCC_ADC1LPEN           (1 << 9)
#define RCC_TIM11LPEN          (1 << 4)
#define RCC_TIM10LPEN          (1 << 3)
#define RCC_TIM9LPEN           (1 << 2)
#define RCC_SYSCFGLPEN         (1 << 0)

// APB1LPENR values
#define RCC_COMPLPEN           (1 << 31)
#define RCC_DACLPEN            (1 << 29)
#define RCC_PWRLPEN            (1 << 28)
#define RCC_USBLPEN            (1 << 23)
#define RCC_I2C2LPEN           (1 << 22)
#define RCC_I2C1LPEN           (1 << 21)
#define RCC_UART5LPEN          (1 << 20)
#define RCC_UART4LPEN          (1 << 19)
#define RCC_USART3LPEN         (1 << 18)
#define RCC_USART2LPEN         (1 << 17)
#define RCC_SPI3LPEN           (1 << 15)
#define RCC_SPI2LPEN           (1 << 14)
#define RCC_WWDGLPEN           (1 << 11)
#define RCC_LCDLPEN            (1 << 9)
#define RCC_TIM7LPEN           (1 << 5)
#define RCC_TIM6LPEN           (1 << 4)
#define RCC_TIM5LPEN           (1 << 3)
#define RCC_TIM4LPEN           (1 << 2)
#define RCC_TIM3LPEN           (1 << 1)
#define RCC_TIM2LPEN           (1 << 0)

// CSR values
#define RCC_LPWRRSTF            (1 << 31)
#define RCC_WWDGRSTF            (1 << 30)
#define RCC_IWDGRSTF            (1 << 29)
#define RCC_SFTRSTF             (1 << 28)
#define RCC_PORRSTF             (1 << 27)
#define RCC_PINRSTF             (1 << 26)
#define RCC_OBLRSTF             (1 << 25)
#define RCC_RMVF                (1 << 24)
#define RCC_RTCRST              (1 << 23)
#define RCC_RTCEN               (1 << 22)
#define RCC_RTCSEL_NO_CLK       (0 << 16)
#define RCC_RTCSEL_LSE          (1 << 16)
#define RCC_RTCSEL_LSI          (2 << 16)
#define RCC_RTCSEL_HSE          (3 << 16)
#define RCC_LSECSSD             (1 << 12)
#define RCC_LSECSSON            (1 << 11)
#define RCC_LSEBYP              (1 << 10)
#define RCC_LSERDY              (1 << 9)
#define RCC_LSEON               (1 << 8)
#define RCC_LSIRDY              (1 << 1)
#define RCC_LSION               (1 << 0)


/////////////////////////////////////////
// Flash interface
/////////////////////////////////////////
typedef struct
{
    arm_reg_t ACR;      // Access control
    arm_reg_t PECR;     // Program/erase control
    arm_reg_t PDKEYR;   // Power down key
    arm_reg_t PEKEYR;   // Program/erase key
    arm_reg_t PRGKEYR;  // Program memory key
    arm_reg_t OPTKEYR;  // Option byte key
    arm_reg_t SR;       // Status
    arm_reg_t OBR;      // Option byte
    arm_reg_t WRPR1;    // Write protection
    arm_reg_t res0[23]; // Reserved
    arm_reg_t WRPR2;    // Write protection
    arm_reg_t WRPR3;    // Write protection
    arm_reg_t WRPR4;    // Write protection
} FLASH_t;

#define FLASH     ((FLASH_t*) STM_FLASH_IFACE_BASE)

// ACR values
#define FLASH_RUN_PD            (1 << 4)
#define FLASH_SLEEP_PD          (1 << 3)
#define FLASH_ACC64             (1 << 2)
#define FLASH_PRFTEN            (1 << 1)
#define FLASH_LATENCY(n)        (n)

// PECR values
#define FLASH_OBL_LAUNCH        (1 << 18)
#define FLASH_ERRIE             (1 << 17)
#define FLASH_EOPIE             (1 << 16)
#define FLASH_PARALLBANK        (1 << 15)
#define FLASH_FPRG              (1 << 10)
#define FLASH_ERASE             (1 << 9)
#define FLASH_FTDW              (1 << 8)
#define FLASH_DATA              (1 << 4)
#define FLASH_PROG              (1 << 3)
#define FLASH_OPTLOCK           (1 << 2)
#define FLASH_PRGLOCK           (1 << 1)
#define FLASH_PELOCK            (1 << 0)

// PDKEYR values
#define FLASH_PDKEY1            0x04152637
#define FLASH_PDKEY2            0xFAFBFCFD

// PEKEYR values
#define FLASH_PEKEY1            0x89ABCDEF
#define FLASH_PEKEY2            0x02030405

// PRGKEYR values
#define FLASH_PRGKEY1           0x8C9DAEBF
#define FLASH_PRGKEY2           0x13141516

// OPTKEYR values
#define FLASH_OPTKEY1           0xFBEAD9C8
#define FLASH_OPTKEY2           0x24252627

// SR values
#define FLASH_RDERR             (1 << 13)
#define FLASH_OPTVERRUSR        (1 << 12)
#define FLASH_OPTVERR           (1 << 11)
#define FLASH_SIZERR            (1 << 10)
#define FLASH_PGAERR            (1 << 9)
#define FLASH_WRPERR            (1 << 8)
#define FLASH_ERR_MASK          (0x1F << 8)
#define FLASH_READY             (1 << 3)
#define FLASH_ENDHV             (1 << 2)
#define FLASH_EOP               (1 << 1)
#define FLASH_BSY               (1 << 0)

// OBR values
#define FLASH_nBFB2             (1 << 23)
#define FLASH_nRST_STDBY        (1 << 22)
#define FLASH_nRST_STOP         (1 << 21)
#define FLASH_IWDG_SW           (1 << 20)
#define FLASH_BOR_OFF           (0 << 19)
#define FLASH_BOR_OFF_MASK      (1 << 19)
#define FLASH_BOR_LEVEL_MASK    (0xF << 16)
#define FLASH_BOR_LEVEL1        (0x8 << 16)
#define FLASH_BOR_LEVEL2        (0x9 << 16)
#define FLASH_BOR_LEVEL3        (0xA << 16)
#define FLASH_BOR_LEVEL4        (0xB << 16)
#define FLASH_BOR_LEVEL5        (0xC << 16)
#define FLASH_SPRMOD            (1 << 8)
#define FLASH_RDPRT_LEVEL0      0xAA
#define FLASH_RDPRT_LEVEL2      0xCC


/////////////////////////////////////////
// Option bytes
/////////////////////////////////////////
typedef struct
{
    arm_reg_t RDP;
    arm_reg_t USER;
    arm_reg_t WRP1_LO;
    arm_reg_t WRP1_HI;
    arm_reg_t WRP2_LO;
    arm_reg_t WRP2_HI;
    arm_reg_t WRP3_LO;
    arm_reg_t WRP3_HI;
    arm_reg_t res0[24];
    arm_reg_t WRP4_LO;
    arm_reg_t WRP4_HI;
} OB_t;

#define OB     ((OB_t*) STM_OB_BASE)

// RDP values
#define OB_RDP_ALWAYS_ONES      0xFE000000
#define OB_nSPRMOD              (1 << 24)
#define OB_nRDP(x)              ((x) << 16)
#define OB_RDP_ALWAYS_ZEROES    0x0000FE00
#define OB_SPRMOD               (1 << 8)
#define OB_RDP_LEVEL0           0xAA
#define OB_RDP_LEVEL2           0xCC

// USER values
// nUSER field
#define OB_BFB2                 (1 << 23)
#define OB_RST_STDBY            (1 << 22)
#define OB_RST_STOP             (1 << 21)
#define OB_nIWDG_SW             (1 << 20)
#define OB_nBOR_OFF             (1 << 19)
#define OB_nBOR_OFF_MASK        (1 << 19)
#define OB_nBOR_LEVEL_MASK      (0xF << 16)
#define OB_nBOR_LEVEL1          (0x7 << 16)
#define OB_nBOR_LEVEL2          (0x6 << 16)
#define OB_nBOR_LEVEL3          (0x5 << 16)
#define OB_nBOR_LEVEL4          (0x4 << 16)
#define OB_nBOR_LEVEL5          (0x3 << 16)
// USER field
#define OB_nBFB2                (1 << 7)
#define OB_nRST_STDBY           (1 << 6)
#define OB_nRST_STOP            (1 << 5)
#define OB_IWDG_SW              (1 << 4)
#define OB_BOR_OFF              (0 << 3)
#define OB_BOR_OFF_MASK         (1 << 3)
#define OB_BOR_LEVEL_MASK       (0xF << 0)
#define OB_BOR_LEVEL1           (0x8 << 0)
#define OB_BOR_LEVEL2           (0x9 << 0)
#define OB_BOR_LEVEL3           (0xA << 0)
#define OB_BOR_LEVEL4           (0xB << 0)
#define OB_BOR_LEVEL5           (0xC << 0)


/////////////////////////////////////////
// CRC calculation
/////////////////////////////////////////
typedef struct
{
    arm_reg_t DR;    // Data
    arm_reg_t IDR;   // Independent data
    arm_reg_t CR;    // Control
} CRC_t;

#define CRC         ((CRC_t*) STM_CRC_BASE)

