alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
// CRC_CR values
#define CRC_RESET       (1 << 0)


/////////////////////////////////////////
// General purpose I/O
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MODER;    // Mode
    arm_reg_t OTYPER;   // Output type
    arm_reg_t OSPEEDR;  // Output speed
    arm_reg_t PUPDR;    // Pull-up/pull-down
    arm_reg_t IDR;      // Input data
    arm_reg_t ODR;      // Output data
    arm_reg_t BSRR;     // Bit set/reset
    arm_reg_t LCKR;     // Configuration lock
    arm_reg_t AFRL;     // Alternate function low register
    arm_reg_t AFRH;     // Alternate function high register
    arm_reg_t BRR;      // Bit reset (Cat. 3,4,5,6 only)
} GPIO_t;

#define GPIOA       ((GPIO_t*) STM_GPIOA_BASE)
#define GPIOB       ((GPIO_t*) STM_GPIOB_BASE)
#define GPIOC       ((GPIO_t*) STM_GPIOC_BASE)
#define GPIOD       ((GPIO_t*) STM_GPIOD_BASE)
#define GPIOE       ((GPIO_t*) STM_GPIOE_BASE)
#define GPIOF       ((GPIO_t*) STM_GPIOF_BASE)
#define GPIOG       ((GPIO_t*) STM_GPIOG_BASE)
#define GPIOH       ((GPIO_t*) STM_GPIOH_BASE)
#define GPIOI       ((GPIO_t*) STM_GPIOI_BASE)

// MODER values
#define GPIO_IN(n)          (0 << (2 * n))  // Input mode
#define GPIO_OUT(n)         (1 << (2 * n))  // General purpose output mode
#define GPIO_ALT(n)         (2 << (2 * n))  // Alternate function mode
#define GPIO_ANA(n)         (3 << (2 * n))  // Analog mode
#define GPIO_MODE_MASK(n)   (3 << (2 * n))  // Mask

// OTYPER values
#define GPIO_PP(n)      (0 << (n))      // Push-pull
#define GPIO_OD(n)      (1 << (n))      // Open drain

// OSPEEDR values
#define GPIO_2MHz(n)        (0 << (2 * n))  // Low speed
#define GPIO_25MHz(n)       (1 << (2 * n))  // Medium speed
#define GPIO_50MHz(n)       (2 << (2 * n))  // Fast speed
#define GPIO_100MHz(n)      (3 << (2 * n))  // High speed
#define GPIO_OSPEED_MASK(n) (3 << (2 * n))  // Field mask

// PUPDR values
#define GPIO_NO_PULL(n)   (0 << (2 * n))  // No pull-up, no pull-down
#define GPIO_PULL_UP(n)   (1 << (2 * n))  // Pull-up
#define GPIO_PULL_DOWN(n) (2 << (2 * n))  // Pull-down

// BSRR values
#define GPIO_SET(n)     (1 << (n))      // Atomic set n-th bit of ODR
#define GPIO_RESET(n)   (1 << (n + 16)) // Atomic reset n-th bit of ODR

// LCKR values
#define GPIO_LCK(n)     (1 << (n))      // Pin configuration lock
#define GPIO_LCKK(n)    (1 << 16)       // Port configuration lock key

// Alternate functions (AFRL and AFRH values)
#define GPIO_AF_SYSTEM(n)   (0x0 << (4 * ((n) & 7)))
#define GPIO_AF_TIM1(n)     (0x1 << (4 * ((n) & 7)))
#define GPIO_AF_TIM2(n)     (0x1 << (4 * ((n) & 7)))
#define GPIO_AF_TIM3(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM4(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM5(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM8(n)     (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM9(n)     (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM10(n)    (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM11(n)    (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_I2C1(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_I2C2(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_I2C3(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_SPI1(n)     (0x5 << (4 * ((n) & 7)))
#define GPIO_AF_SPI2(n)     (0x5 << (4 * ((n) & 7)))
#define GPIO_AF_SPI3(n)     (0x6 << (4 * ((n) & 7)))
#define GPIO_AF_USART1(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART2(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART3(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART4(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_USART5(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_USART6(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_CAN1(n)     (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_CAN2(n)     (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM12(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM13(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM14(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_OTG_FS(n)   (0xA << (4 * ((n) & 7)))
#define GPIO_AF_OTG_HS(n)   (0xA << (4 * ((n) & 7)))
#define GPIO_AF_ETH(n)      (0xB << (4 * ((n) & 7)))
#define GPIO_AF_FSMC(n)     (0xC << (4 * ((n) & 7)))
#define GPIO_AF_SDIO(n)     (0xC << (4 * ((n) & 7)))
#define GPIO_AF_OTG_HS_FS(n) (0xC << (4 * ((n) & 7)))
#define GPIO_AF_DCMI(n)     (0xD << (4 * ((n) & 7)))
#define GPIO_AF_EVENTOUT(n) (0xF << (4 * ((n) & 7)))
#define GPIO_AF_MASK(n)     (0xF << (4 * ((n) & 7)))


/////////////////////////////////////////
// SYSCFG
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MEMRMP;   // memory remap
    arm_reg_t PMC;      // peripheral mode configuration
    arm_reg_t EXTICR1;  // external interrupt configuration 1
    arm_reg_t EXTICR2;  // external interrupt configuration 2
    arm_reg_t EXTICR3;  // external interrupt configuration 3
    arm_reg_t EXTICR4;  // external interrupt configuration 4
} SYSCFG_t;

#define SYSCFG      ((SYSCFG_t*) STM_SYSCFG_BASE)

// SYSCFG_MEMRMP values
#define SYSCFG_BOOT_MAIN_FLASH      (0 << 8)
#define SYSCFG_BOOT_SYSTEM_FLASH    (1 << 8)
#define SYSCFG_BOOT_EMB_SRAM        (3 << 8)
#define SYSCFG_MEM_MAIN_FLASH       (0 << 8)
#define SYSCFG_MEM_SYSTEM_FLASH     (1 << 8)
#define SYSCFG_MEM_FSMC             (2 << 8)
#define SYSCFG_MEM_SRAM             (3 << 8)

// SYSCFG_PMC values
#define SYSCFG_LCD_CAPA_PE12        (1 << 5)
#define SYSCFG_LCD_CAPA_PE11        (1 << 4)
#define SYSCFG_LCD_CAPA_PB0         (1 << 3)
#define SYSCFG_LCD_CAPA_PB12        (1 << 2)
#define SYSCFG_LCD_CAPA_PB2         (1 << 1)
#define SYSCFG_USB_PU               (1 << 0)

// SYSCFG_EXTICRx values
#define SYSCFG_PA(x)                (0 << (((x) & 3) * 4))
#define SYSCFG_PB(x)                (1 << (((x) & 3) * 4))
#define SYSCFG_PC(x)                (2 << (((x) & 3) * 4))
#define SYSCFG_PD(x)                (3 << (((x) & 3) * 4))
#define SYSCFG_PE(x)                (4 << (((x) & 3) * 4))
#define SYSCFG_PH(x)                (5 << (((x) & 3) * 4))
#define SYSCFG_PF(x)                (6 << (((x) & 3) * 4))
#define SYSCFG_PG(x)                (7 << (((x) & 3) * 4))
#define SYSCFG_PMASK(x)             (0xF << (((x) & 3) * 4))


/////////////////////////////////////////
// ADC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t SR;       // status
    arm_reg_t CR1;      // control 1
    arm_reg_t CR2;      // control 2
    arm_reg_t SMPR1;    // sample time 1
    arm_reg_t SMPR2;    // sample time 2
    arm_reg_t SMPR3;    // sample time 3
    arm_reg_t JOFR1;    // injected channel data offset 1
    arm_reg_t JOFR2;    // injected channel data offset 2
    arm_reg_t JOFR3;    // injected channel data offset 3
    arm_reg_t JOFR4;    // injected channel data offset 4
    arm_reg_t HTR;      // watchdog higher threshold
    arm_reg_t LTR;      // watchdog lower threshold
    arm_reg_t SQR1;     // regular sequence 1
    arm_reg_t SQR2;     // regular sequence 2
    arm_reg_t SQR3;     // regular sequence 3
    arm_reg_t SQR4;     // regular sequence 4
    arm_reg_t SQR5;     // regular sequence 5
    arm_reg_t JSQR;     // injected sequence
    arm_reg_t JDR1;     // injected data 1
    arm_reg_t JDR2;     // injected data 2
    arm_reg_t JDR3;     // injected data 3
    arm_reg_t JDR4;     // injected data 4
    arm_reg_t DR;       // regular data
    arm_reg_t SMPR0;    // sample time 0
    arm_reg_t gap0[168];
    arm_reg_t CSR;      // common status
    arm_reg_t CCR;      // common control
} ADC_t;

#define ADC   ((ADC_t*) STM_ADC_BASE)

// ADC_SR
#define ADC_JCNR                (1 << 9)
#define ADC_RCNR                (1 << 8)
#define ADC_ADONS               (1 << 6)
#define ADC_OVR                 (1 << 5)
#define ADC_STRT                (1 << 4)
#define ADC_JSTRT               (1 << 3)
#define ADC_JEOC                (1 << 2)
#define ADC_EOC                 (1 << 1)
#define ADC_AWD                 (1 << 0)

