alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
// ADC_CR1
#define ADC_OVRIE               (1 << 26)
#define ADC_RES_12BIT           (0 << 24)
#define ADC_RES_10BIT           (1 << 24)
#define ADC_RES_8BIT            (2 << 24)
#define ADC_RES_6BIT            (3 << 24)
#define ADC_AWDEN               (1 << 23)
#define ADC_JAWDEN              (1 << 22)
#define ADC_PDI                 (1 << 17)
#define ADC_PDD                 (1 << 16)
#define ADC_DISCNUM(n)          ((n) << 13)
#define ADC_JDISCEN             (1 << 12)
#define ADC_DISCEN              (1 << 11)
#define ADC_JAUTO               (1 << 10)
#define ADC_AWDSGL              (1 << 9)
#define ADC_SCAN                (1 << 8)
#define ADC_JOECIE              (1 << 7)
#define ADC_AWDIE               (1 << 6)
#define ADC_OECIE               (1 << 5)
#define ADC_AWDCH(n)            ((n) & 0x1F)

// ADC_CR2
#define ADC_SWSTART             (1 << 30)
#define ADC_EXTEN_DISABLE       (0 << 28)
#define ADC_EXTEN_RISING        (1 << 28)
#define ADC_EXTEN_FALLING       (2 << 28)
#define ADC_EXTEN_BOTH          (3 << 28)
#define ADC_EXTSEL_TIM9_CC2     (0 << 24)
#define ADC_EXTSEL_TIM9_TRGO    (1 << 24)
#define ADC_EXTSEL_TIM2_CC3     (2 << 24)
#define ADC_EXTSEL_TIM2_CC2     (3 << 24)
#define ADC_EXTSEL_TIM3_TRGO    (4 << 24)
#define ADC_EXTSEL_TIM4_CC4     (5 << 24)
#define ADC_EXTSEL_TIM2_TRGO    (6 << 24)
#define ADC_EXTSEL_TIM3_CC1     (7 << 24)
#define ADC_EXTSEL_TIM3_CC3     (8 << 24)
#define ADC_EXTSEL_TIM4_TRGO    (9 << 24)
#define ADC_EXTSEL_TIM6_TRGO    (10 << 24)
#define ADC_EXTSEL_EXTI11       (15 << 24)
#define ADC_JSWSTART            (1 << 22)
#define ADC_JEXTEN_DISABLE      (0 << 20)
#define ADC_JEXTEN_RISING       (1 << 20)
#define ADC_JEXTEN_FALLING      (2 << 20)
#define ADC_JEXTEN_BOTH         (3 << 20)
#define ADC_JEXTSEL_TIM9_CC1    (0 << 16)
#define ADC_JEXTSEL_TIM9_TRGO   (1 << 16)
#define ADC_JEXTSEL_TIM2_TRGO   (2 << 16)
#define ADC_JEXTSEL_TIM2_CC1    (3 << 16)
#define ADC_JEXTSEL_TIM3_CC4    (4 << 16)
#define ADC_JEXTSEL_TIM4_TRGO   (5 << 16)
#define ADC_JEXTSEL_TIM4_CC1    (6 << 16)
#define ADC_JEXTSEL_TIM4_CC2    (7 << 16)
#define ADC_JEXTSEL_TIM4_CC3    (8 << 16)
#define ADC_JEXTSEL_TIM10_CC1   (9 << 16)
#define ADC_JEXTSEL_TIM7_TRGO   (10 << 16)
#define ADC_JEXTSEL_EXTI15      (15 << 16)
#define ADC_ALIGN               (1 << 11)
#define ADC_EOCS                (1 << 10)
#define ADC_DDS                 (1 << 9)
#define ADC_DMA                 (1 << 8)
#define ADC_DELS_NO_DELAY       (0 << 4)
#define ADC_DELS_UNTIL_READ     (1 << 4)
#define ADC_DELS_7              (2 << 4)
#define ADC_DELS_15             (3 << 4)
#define ADC_DELS_31             (4 << 4)
#define ADC_DELS_63             (5 << 4)
#define ADC_DELS_127            (6 << 4)
#define ADC_DELS_255            (7 << 4)
#define ADC_CFG                 (1 << 2)
#define ADC_CONT                (1 << 1)
#define ADC_ADON                (1 << 0)

// ADC_SMPR1, ADC_SMPR2, ADC_SMPR3, ADC_SMPR0
#define ADC_SMP_4CYCLES(n)      (0 << (3 * (n%10)))
#define ADC_SMP_9CYCLES(n)      (1 << (3 * (n%10)))
#define ADC_SMP_16CYCLES(n)     (2 << (3 * (n%10)))
#define ADC_SMP_24CYCLES(n)     (3 << (3 * (n%10)))
#define ADC_SMP_48CYCLES(n)     (4 << (3 * (n%10)))
#define ADC_SMP_96CYCLES(n)     (5 << (3 * (n%10)))
#define ADC_SMP_192CYCLES(n)    (6 << (3 * (n%10)))
#define ADC_SMP_384CYCLES(n)    (7 << (3 * (n%10)))

// ADC_SQR1
#define ADC_L(n)                ((n) << 20)
#define ADC_SQ28(n)             ((n) << 15)
#define ADC_SQ27(n)             ((n) << 10)
#define ADC_SQ26(n)             ((n) << 5)
#define ADC_SQ25(n)             ((n) << 0)

// ADC_SQR2
#define ADC_SQ24(n)             ((n) << 26)
#define ADC_SQ23(n)             ((n) << 20)
#define ADC_SQ22(n)             ((n) << 15)
#define ADC_SQ21(n)             ((n) << 10)
#define ADC_SQ20(n)             ((n) << 5)
#define ADC_SQ19(n)             ((n) << 0)

// ADC_SQR3
#define ADC_SQ18(n)             ((n) << 25)
#define ADC_SQ17(n)             ((n) << 20)
#define ADC_SQ16(n)             ((n) << 15)
#define ADC_SQ15(n)             ((n) << 10)
#define ADC_SQ14(n)             ((n) << 5)
#define ADC_SQ13(n)             ((n) << 0)

// ADC_SQR4
#define ADC_SQ12(n)             ((n) << 26)
#define ADC_SQ11(n)             ((n) << 20)
#define ADC_SQ10(n)             ((n) << 15)
#define ADC_SQ9(n)              ((n) << 10)
#define ADC_SQ8(n)              ((n) << 5)
#define ADC_SQ7(n)              ((n) << 0)

// ADC_SQR5
#define ADC_SQ6(n)              ((n) << 25)
#define ADC_SQ5(n)              ((n) << 20)
#define ADC_SQ4(n)              ((n) << 15)
#define ADC_SQ3(n)              ((n) << 10)
#define ADC_SQ2(n)              ((n) << 5)
#define ADC_SQ1(n)              ((n) << 0)

// ADC_JSQR
#define ADC_JL(n)               ((n) << 20)
#define ADC_JSQ4(n)             ((n) << 15)
#define ADC_JSQ3(n)             ((n) << 10)
#define ADC_JSQ2(n)             ((n) << 5)
#define ADC_JSQ1(n)             ((n) << 0)

// ADC_CSR
#define ADC_ADONS1              (1 << 6)
#define ADC_OVR1                (1 << 5)
#define ADC_STRT1               (1 << 4)
#define ADC_JSTRT1              (1 << 3)
#define ADC_JEOC1               (1 << 2)
#define ADC_EOC1                (1 << 1)
#define ADC_AWD1                (1 << 0)

// ADC_CSR
#define ADC_ADONS1              (1 << 6)
#define ADC_OVR1                (1 << 5)
#define ADC_STRT1               (1 << 4)
#define ADC_JSTRT1              (1 << 3)
#define ADC_JEOC1               (1 << 2)
#define ADC_EOC1                (1 << 1)
#define ADC_AWD1                (1 << 0)

// ADC_CCR
#define ADC_TSVREFE             (1 << 23)
#define ADC_HSI_DIV_1           (0 << 16)
#define ADC_HSI_DIV_2           (1 << 16)
#define ADC_HSI_DIV_4           (2 << 16)


/////////////////////////////////////////
// DAC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // control
    arm_reg_t SWTRIGR;  // software trigger
    arm_reg_t DHR12R1;  // channel1 12-bit right-aligned data
    arm_reg_t DHR12L1;  // channel1 12-bit left aligned data
    arm_reg_t DHR8R1;   // channel1 8-bit right aligned data
    arm_reg_t DHR12R2;  // channel2 12-bit right aligned data
    arm_reg_t DHR12L2;  // channel2 12-bit left aligned data
    arm_reg_t DHR8R2;   // channel2 8-bit right-aligned data
    arm_reg_t DHR12RD;  // dual DAC 12-bit right-aligned data
    arm_reg_t DHR12LD;  // dual DAC 12-bit left aligned data
    arm_reg_t DHR8RD;   // dual DAC 8-bit right aligned data
    arm_reg_t DOR1;     // channel1 data output
    arm_reg_t DOR2;     // channel2 data output
    arm_reg_t SR;       // status
} DAC_t;

