alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
#define DAC   ((DAC_t*) STM_DAC_BASE)

// DAC_CR values
#define DMA_DMAUDRIE2           (1 << 29)
#define DMA_DMAEN2              (1 << 28)
#define DMA_MAMP2(n)            ((n) << 24)
#define DMA_WAVE2(n)            ((n) << 22)
#define DMA_TSEL2(n)            ((n) << 19)
#define DMA_TEN2                (1 << 18)
#define DMA_BOFF2               (1 << 17)
#define DMA_EN2                 (1 << 16)
#define DMA_DMAUDRIE1           (1 << 13)
#define DMA_DMAEN1              (1 << 12)
#define DMA_MAMP1(n)            ((n) << 8)
#define DMA_WAVE1(n)            ((n) << 6)
#define DMA_TSEL1(n)            ((n) << 3)
#define DMA_TEN1                (1 << 2)
#define DMA_BOFF1               (1 << 1)
#define DMA_EN1                 (1 << 0)

// DAC_SWTRIGR values
#define DAC_SWTRIG2             (1 << 1)
#define DAC_SWTRIG1             (1 << 0)

// DAC_SR values
#define DAC_DMAUDR2             (1 << 29)
#define DAC_DMAUDR1             (1 << 13)


/////////////////////////////////////////
// Comparators (COMP)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CSR;      // control and status
} COMP_t;

#define COMP   ((COMP_t*) STM_COMP_BASE)

// COMP_CSR values
#define COMP_TSUSP                  (1 << 31)
#define COMP_CAIF                   (1 << 30)
#define COMP_CAIE                   (1 << 29)
#define COMP_RCH13                  (1 << 28)
#define COMP_FCH8                   (1 << 27)
#define COMP_FCH3                   (1 << 26)
#define COMP_OUTSEL_TIM2_INP_CAP4   (0 << 21)
#define COMP_OUTSEL_TIM2_OCREF_CLR  (1 << 21)
#define COMP_OUTSEL_TIM3_INP_CAP4   (2 << 21)
#define COMP_OUTSEL_TIM3_OCREF_CLR  (3 << 21)
#define COMP_OUTSEL_TIM4_INP_CAP4   (4 << 21)
#define COMP_OUTSEL_TIM4_OCREF_CLR  (5 << 21)
#define COMP_OUTSEL_TIM10_INP_CAP1  (6 << 21)
#define COMP_OUTSEL_NO_REDIR        (7 << 21)
#define COMP_INSEL_NO_SEL           (0 << 18)
#define COMP_INSEL_EXT_IO           (1 << 18)
#define COMP_INSEL_VREFINT          (2 << 18)
#define COMP_INSEL_3_4_VREFINT      (3 << 18)
#define COMP_INSEL_1_2_VREFINT      (4 << 18)
#define COMP_INSEL_1_4_VREFINT      (5 << 18)
#define COMP_INSEL_DAC_OUT1         (6 << 18)
#define COMP_INSEL_DAC_OUT2         (7 << 18)
#define COMP_INSEL_MASK			        (7 << 18)
#define COMP_WNDWE                  (1 << 17)
#define COMP_VREFOUTEN              (1 << 16)
#define COMP_CMP2OUT                (1 << 13)
#define COMP_SPEED                  (1 << 12)
#define COMP_CMP1OUT                (1 << 7)
#define COMP_SW1                    (1 << 5)
#define COMP_CMP1EN                 (1 << 4)
#define COMP_400KPD                 (1 << 3)
#define COMP_10KPD                  (1 << 2)
#define COMP_400KPU                 (1 << 1)
#define COMP_10KPU                  (1 << 0)


/////////////////////////////////////////
// Timers (TIMx)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR1;      // control register 1
    arm_reg_t CR2;      // control register 2
    arm_reg_t SMCR;     // slave mode control register
    arm_reg_t DIER;     // DMA/Interrupt enable register
    arm_reg_t SR;       // status register
    arm_reg_t EGR;      // event generation register
    arm_reg_t CCMR1;    // capture/compare mode register 1
    arm_reg_t CCMR2;    // capture/compare mode register 2
    arm_reg_t CCER;     // capture/compare enable register
    arm_reg_t CNT;      // counter
    arm_reg_t PSC;      // prescaler
    arm_reg_t ARR;      // auto-reload register
    arm_reg_t gap0;
    arm_reg_t CCR1;     // capture/compare register 1
    arm_reg_t CCR2;     // capture/compare register 2
    arm_reg_t CCR3;     // capture/compare register 3
    arm_reg_t CCR4;     // capture/compare register 4
    arm_reg_t gap1;
    arm_reg_t DCR;      // DMA control register
    arm_reg_t DMAR;     // DMA address for full transfer
    arm_reg_t OR;       // option register
} TIM_t;

#define TIM2   ((TIM_t*) STM_TIM2_BASE)
#define TIM3   ((TIM_t*) STM_TIM3_BASE)
#define TIM4   ((TIM_t*) STM_TIM4_BASE)
#define TIM5   ((TIM_t*) STM_TIM5_BASE)
#define TIM6   ((TIM_t*) STM_TIM6_BASE)
#define TIM7   ((TIM_t*) STM_TIM7_BASE)
#define TIM9   ((TIM_t*) STM_TIM9_BASE)
#define TIM10  ((TIM_t*) STM_TIM10_BASE)
#define TIM11  ((TIM_t*) STM_TIM11_BASE)

// TIMx_CR1
#define TIM_CKD(x)      ((x) << 8)
#define TIM_ARPE        (1 << 7)
#define TIM_CMS         ((x) << 5)
#define TIM_DIR         (1 << 4)
#define TIM_OPM         (1 << 3)
#define TIM_URS         (1 << 2)
#define TIM_UDIS        (1 << 1)
#define TIM_CEN         (1 << 0)

// TIMx_CR2
#define TIM_TI1S        (1 << 7)
#define TIM_MMS(x)      ((x) << 4)
#define TIM_CCDS        (1 << 3)

// TIMx_CMSR
#define TIM_ETP         (1 << 15)
#define TIM_ECE         (1 << 14)
#define TIM_ETPS(x)     ((x) << 12)
#define TIM_ETF(x)      ((x) << 8)
#define TIM_MSM         (1 << 7)
#define TIM_TS(x)       ((x) << 4)
#define TIM_OCCS        (1 << 3)
#define TIM_SMS(x)      (x)

// TIMx_DIER
#define TIM_TDE         (1 << 14)
#define TIM_CC4DE       (1 << 12)
#define TIM_CC3DE       (1 << 11)
#define TIM_CC2DE       (1 << 10)
#define TIM_CC1DE       (1 << 9)
#define TIM_UDE         (1 << 8)
#define TIM_TIE         (1 << 6)
#define TIM_CC4IE       (1 << 4)
#define TIM_CC3IE       (1 << 3)
#define TIM_CC2IE       (1 << 2)
#define TIM_CC1IE       (1 << 1)
#define TIM_UIE         (1 << 0)

// TIMx_SR
#define TIM_CC4OF       (1 << 12)
#define TIM_CC3OF       (1 << 11)
#define TIM_CC2OF       (1 << 10)
#define TIM_CC1OF       (1 << 9)
#define TIM_TIF         (1 << 6)
#define TIM_CC4IF       (1 << 4)
#define TIM_CC3IF       (1 << 3)
#define TIM_CC2IF       (1 << 2)
#define TIM_CC1IF       (1 << 1)
#define TIM_UIF         (1 << 0)

// TIMx_EGR
#define TIM_TG          (1 << 6)
#define TIM_CC4G        (1 << 4)
#define TIM_CC3G        (1 << 3)
#define TIM_CC2G        (1 << 2)
#define TIM_CC1G        (1 << 1)
#define TIM_UG          (1 << 0)

// TIMx_CCMR1
// output compare mode
#define TIM_OC2CE       (1 << 15)
#define TIM_OC2M(x)     ((x) << 12)
#define TIM_OC2PE       (1 << 11)
#define TIM_OC2FE       (1 << 10)
#define TIM_CC2S(x)     ((x) << 8)
#define TIM_OC1CE       (1 << 7)
#define TIM_OC1M(x)     ((x) << 4)
#define TIM_OC1PE       (1 << 3)
#define TIM_OC1FE       (1 << 2)
#define TIM_CC1S(x)     (x)
// input capture mode
#define TIM_IC2F(x)     ((x) << 12)
#define TIM_IC2PSC(x)   ((x) << 10)
#define TIM_CC2S(x)     ((x) << 8)
#define TIM_IC1F        ((x) << 4)
#define TIM_IC1PSC(x)   ((x) << 2)
#define TIM_CC1S(x)     (x)

// TIMx_CCMR2
// output compare mode
#define TIM_OC4CE       (1 << 15)
#define TIM_OC4M(x)     ((x) << 12)
#define TIM_OC4PE       (1 << 11)
#define TIM_OC4FE       (1 << 10)
#define TIM_CC4S(x)     ((x) << 8)
#define TIM_OC3CE       (1 << 7)
#define TIM_OC3M(x)     ((x) << 4)
#define TIM_OC3PE       (1 << 3)
#define TIM_OC3FE       (1 << 2)
#define TIM_CC3S(x)     (x)
// input capture mode
#define TIM_IC4F(x)     ((x) << 12)
#define TIM_IC4PSC(x)   ((x) << 10)
#define TIM_CC4S(x)     ((x) << 8)
#define TIM_IC3F        ((x) << 4)
#define TIM_IC3PSC(x)   ((x) << 2)
#define TIM_CC3S(x)     (x)

// TIMx_CCER
#define TIM_CC4NP       (1 << 15)
#define TIM_CC4P        (1 << 13)
#define TIM_CC4E        (1 << 12)
#define TIM_CC3NP       (1 << 11)
#define TIM_CC3P        (1 << 9)
#define TIM_CC3E        (1 << 8)
#define TIM_CC2NP       (1 << 7)
#define TIM_CC2P        (1 << 5)
#define TIM_CC2E        (1 << 4)
#define TIM_CC1NP       (1 << 3
#define TIM_CC1P        (1 << 1)
#define TIM_CC1E        (1 << 0)

// TIMx_DCR
#define TIM_DBL(x)      ((x) << 8)
#define TIM_DBA(x)      (x)

// TIMx_OR
#define TIM2_ITR1_RMP    (1 << 0)
#define TIM3_ITR2_RMP    (1 << 0)
#define TIM9_ITR1_RMP    (1 << 2)
#define TIM9_TI1_RMP(x)  (x)
#define TIM10_TI1_RMP_RI (1 << 3)
#define TIM10_ETR_RMP    (1 << 2)
#define TIM10_TI1_RMP(x) (x)
#define TIM11_TI1_RMP_RI (1 << 3)
#define TIM11_ETR_RMP    (1 << 2)
#define TIM11_TI1_RMP(x) (x)



/////////////////////////////////////////
// Routing Interface (RI)
/////////////////////////////////////////
typedef struct
{
  arm_reg_t ICR;       // input capture register,                           Address offset: 0x04
  arm_reg_t ASCR1;     // analog switches control register,                 Address offset: 0x08
  arm_reg_t ASCR2;     // analog switch control register 2,                 Address offset: 0x0C
  arm_reg_t HYSCR1;    // hysteresis control register 1,                    Address offset: 0x10
  arm_reg_t HYSCR2;    // Hysteresis control register 2,                    Address offset: 0x14
  arm_reg_t HYSCR3;    // Hysteresis control register 3,                    Address offset: 0x18
  arm_reg_t HYSCR4;    // Hysteresis control register 4,                    Address offset: 0x1C
  arm_reg_t ASMR1;     // Analog switch mode register 1,                    Address offset: 0x20
  arm_reg_t CMR1;      // Channel mask register 1,                          Address offset: 0x24
  arm_reg_t CICR1;     // Channel identification for capture register 1,    Address offset: 0x28
  arm_reg_t ASMR2;     // Analog switch mode register 2,                    Address offset: 0x2C
  arm_reg_t CMR2;      // Channel mask register 2,                          Address offset: 0x30
  arm_reg_t CICR2;     // Channel identification for capture register 2,    Address offset: 0x34
  arm_reg_t ASMR3;     // Analog switch mode register 3,                    Address offset: 0x38
  arm_reg_t CMR3;      // Channel mask register 3,                          Address offset: 0x3C
  arm_reg_t CICR3;     // Channel identification for capture register3 ,    Address offset: 0x40
  arm_reg_t ASMR4;     // Analog switch mode register 4,                    Address offset: 0x44
  arm_reg_t CMR4;      // Channel mask register 4,                          Address offset: 0x48
  arm_reg_t CICR4;     // Channel identification for capture register 4,    Address offset: 0x4C
  arm_reg_t ASMR5;     // Analog switch mode register 5,                    Address offset: 0x50
  arm_reg_t CMR5;      // Channel mask register 5,                          Address offset: 0x54
  arm_reg_t CICR5;     // Channel identification for capture register 5,    Address offset: 0x58
} RI_t;

#define   RI      ((RI_t *) STM_RI_BASE)

//RI_ICR
#define   RI_IC4                            (1 << 21)
#define   RI_IC3                            (1 << 20)
#define   RI_IC2                            (1 << 19)
#define   RI_IC1                            (1 << 18)

#define   RI_TIM_NONE                       (0 << 16)
#define   RI_TIM2                           (1 << 16)
#define   RI_TIM3                           (2 << 16)
#define   RI_TIM4                           (3 << 16)
#define   RI_TIM_MASK                       (3 << 16)

