alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
#define   RI_IC4IOS_PA3                     (0 << 12)
#define   RI_IC4IOS_PA7                     (1 << 12)
#define   RI_IC4IOS_PA11                    (2 << 12)
#define   RI_IC4IOS_PA15                    (3 << 12)
#define   RI_IC4IOS_PC3                     (4 << 12)
#define   RI_IC4IOS_PC7                     (5 << 12)
#define   RI_IC4IOS_PC11                    (6 << 12)
#define   RI_IC4IOS_PC15                    (7 << 12)
#define   RI_IC4IOS_PD3                     (8 << 12)
#define   RI_IC4IOS_PD7                     (9 << 12)
#define   RI_IC4IOS_PD11                    (10 << 12)
#define   RI_IC4IOS_PD15                    (11 << 12)
#define   RI_IC4IOS_PE3                     (12 << 12)
#define   RI_IC4IOS_PE7                     (13 << 12)
#define   RI_IC4IOS_PE11                    (14 << 12)
#define   RI_IC4IOS_PE15                    (15 << 12)
#define   RI_IC4IOS_MASK                    (15 << 12)

#define   RI_IC3IOS_PA2                     (0 << 8)
#define   RI_IC3IOS_PA6                     (1 << 8)
#define   RI_IC3IOS_PA10                    (2 << 8)
#define   RI_IC3IOS_PA14                    (3 << 8)
#define   RI_IC3IOS_PC2                     (4 << 8)
#define   RI_IC3IOS_PC6                     (5 << 8)
#define   RI_IC3IOS_PC10                    (6 << 8)
#define   RI_IC3IOS_PC14                    (7 << 8)
#define   RI_IC3IOS_PD2                     (8 << 8)
#define   RI_IC3IOS_PD6                     (9 << 8)
#define   RI_IC3IOS_PD10                    (10 << 8)
#define   RI_IC3IOS_PD14                    (11 << 8)
#define   RI_IC3IOS_PE2                     (12 << 8)
#define   RI_IC3IOS_PE6                     (13 << 8)
#define   RI_IC3IOS_PE10                    (14 << 8)
#define   RI_IC3IOS_PE14                    (15 << 8)
#define   RI_IC3IOS_MASK                    (15 << 8)

#define   RI_IC2IOS_PA1                     (0 << 4)
#define   RI_IC2IOS_PA5                     (1 << 4)
#define   RI_IC2IOS_PA9                     (2 << 4)
#define   RI_IC2IOS_PA13                    (3 << 4)
#define   RI_IC2IOS_PC1                     (4 << 4)
#define   RI_IC2IOS_PC5                     (5 << 4)
#define   RI_IC2IOS_PC9                     (6 << 4)
#define   RI_IC2IOS_PC13                    (7 << 4)
#define   RI_IC2IOS_PD1                     (8 << 4)
#define   RI_IC2IOS_PD5                     (9 << 4)
#define   RI_IC2IOS_PD9                     (10 << 4)
#define   RI_IC2IOS_PD13                    (11 << 4)
#define   RI_IC2IOS_PE1                     (12 << 4)
#define   RI_IC2IOS_PE5                     (13 << 4)
#define   RI_IC2IOS_PE9                     (14 << 4)
#define   RI_IC2IOS_PE13                    (15 << 4)
#define   RI_IC2IOS_MASK                    (15 << 4)

#define   RI_IC1IOS_PA0                     (0 << 0)
#define   RI_IC1IOS_PA4                     (1 << 0)
#define   RI_IC1IOS_PA8                     (2 << 0)
#define   RI_IC1IOS_PA12                    (3 << 0)
#define   RI_IC1IOS_PC0                     (4 << 0)
#define   RI_IC1IOS_PC4                     (5 << 0)
#define   RI_IC1IOS_PC8                     (6 << 0)
#define   RI_IC1IOS_PC12                    (7 << 0)
#define   RI_IC1IOS_PD0                     (8 << 0)
#define   RI_IC1IOS_PD4                     (9 << 0)
#define   RI_IC1IOS_PD8                     (10 << 0)
#define   RI_IC1IOS_PD12                    (11 << 0)
#define   RI_IC1IOS_PE0                     (12 << 0)
#define   RI_IC1IOS_PE4                     (13 << 0)
#define   RI_IC1IOS_PE8                     (14 << 0)
#define   RI_IC1IOS_PE12                    (15 << 0)
#define   RI_IC1IOS_MASK                    (15 << 0)

//RI_ASCR1
#define   RI_SCM                            (1 << 31)
#define   RI_CH(n)                          (1 << n)
#define   RI_VCOMP                          (1 << 26)

//RI_ASCR2
#define   RI_GR64                           (1 << 28)
#define   RI_GR63                           (1 << 27)
#define   RI_GR77                           (1 << 26)
#define   RI_GR76                           (1 << 25)
#define   RI_GR75                           (1 << 24)
#define   RI_GR25                           (1 << 23)
#define   RI_GR24                           (1 << 22)
#define   RI_GR23                           (1 << 21)
#define   RI_GR94                           (1 << 20)
#define   RI_GR93                           (1 << 19)
#define   RI_GR35                           (1 << 18)
#define   RI_GR34                           (1 << 17)
#define   RI_GR33                           (1 << 16)
#define   RI_GR43                           (1 << 11)
#define   RI_GR42                           (1 << 10)
#define   RI_GR41                           (1 << 9)
#define   RI_GR53                           (1 << 8)
#define   RI_GR52                           (1 << 7)
#define   RI_GR51                           (1 << 6)
#define   RI_GR62                           (1 << 5)
#define   RI_GR61                           (1 << 4)
#define   RI_GR104                          (1 << 3)
#define   RI_GR103                          (1 << 2)
#define   RI_GR102                          (1 << 1)
#define   RI_GR101                          (1 << 0)

//RI_HYSCR1
#define   RI_HYST_PB(n)                     (1 << (16+n))
#define   RI_HYST_PA(n)                     (1 << n)

//RI_HYSCR2
#define   RI_HYST_PD(n)                     (1 << (16+n))
#define   RI_HYST_PC(n)                     (1 << n)

//RI_HYSCR3
#define   RI_HYST_PF(n)                     (1 << (16+n))
#define   RI_HYST_PE(n)                     (1 << n)

//RI_HYSCR4
#define   RI_HYST_PG(n)                     (1 << n)

//RI_ASMR1
#define   RI_ASM_PA(n)                      (1 << n)

//RI_CMR1
#define   RI_CMR_PA(n)                      (1 << n)

//RI_CICR1
#define   RI_CICR_PA(n)                     (1 << n)

//RI_ASMR2
#define   RI_ASM_PB(n)                      (1 << n)

//RI_CMR2
#define   RI_CMR_PB(n)                      (1 << n)

//RI_CICR2
#define   RI_CICR_PB(n)                     (1 << n)

