alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32l1.h
// SPI_SR values
#define SPI_FRE             (1 << 8)
#define SPI_BSY             (1 << 7)
#define SPI_OVR             (1 << 6)
#define SPI_MODF            (1 << 5)
#define SPI_CRCERR          (1 << 4)
#define SPI_UDR             (1 << 3)
#define SPI_CHSIDE          (1 << 2)
#define SPI_TXE             (1 << 1)
#define SPI_RXNE            (1 << 0)

// SPI_I2SCFGR values
#define SPI_I2SMOD              (1 << 11)
#define SPI_I2SE                (1 << 10)
#define SPI_I2SCFG_SLAVE_TX     (0 << 8)
#define SPI_I2SCFG_SLAVE_RX     (1 << 8)
#define SPI_I2SCFG_MASTER_TX    (2 << 8)
#define SPI_I2SCFG_MASTER_RX    (3 << 8)
#define SPI_PCMSYNC             (1 << 7)
#define SPI_I2SSTD_PHILIPS      (0 << 4)
#define SPI_I2SSTD_MSB_JUST     (1 << 4)
#define SPI_I2SSTD_LSB_JUST     (2 << 4)
#define SPI_I2SSTD_PCM          (3 << 4)
#define SPI_CKPOL               (1 << 3)
#define SPI_DATLEN_16BIT        (0 << 1)
#define SPI_DATLEN_24BIT        (1 << 1)
#define SPI_DATLEN_32BIT        (2 << 1)
#define SPI_CHLEN_16BIT         (0 << 0)
#define SPI_CHLEN_32BIT         (1 << 0)

// SPI_I2SPR values
#define SPI_MCKOE           (1 << 9)
#define SPI_ODD             (1 << 8)
#define SPI_I2SDIV(x)       (x)

/////////////////////////////////////////
// DMA
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CCR;      // Configuration
    arm_reg_t CNDTR;    // Number of data
    arm_reg_t CPAR;     // Peripheral address
    arm_reg_t CMAR;     // Memory address
    arm_reg_t reserved;
} DMA_CHANNEL_t;

typedef struct
{
    arm_reg_t       ISR;        // Interrupt Status
    arm_reg_t       IFCR;       // Interrupt Flag Clear
    DMA_CHANNEL_t   chan[7];    // DMA channels registers
} DMA_t;

#define DMA1    ((DMA_t*) STM_DMA1_BASE)
#define DMA2    ((DMA_t*) STM_DMA2_BASE)

#define DMA1_CH(x)  ((DMA_CHANNEL_t *) &(DMA1->chan[(x)-1]))
#define DMA2_CH(x)  ((DMA_CHANNEL_t *) &(DMA2->chan[(x)-1]))

// ISR values
#define DMA_TEIF(x)         (8 << (((x) - 1) * 4))
#define DMA_HTIF(x)         (4 << (((x) - 1) * 4))
#define DMA_TCIF(x)         (2 << (((x) - 1) * 4))
#define DMA_GIF(x)          (1 << (((x) - 1) * 4))

// IFCR values
#define DMA_CTEIF(x)        (8 << (((x) - 1) * 4))
#define DMA_CHTIF(x)        (4 << (((x) - 1) * 4))
#define DMA_CTCIF(x)        (2 << (((x) - 1) * 4))
#define DMA_CGIF(x)         (1 << (((x) - 1) * 4))

// CCR values
#define DMA_MEM2MEM         (1 << 14)
#define DMA_PL(x)           ((x) << 12)
#define DMA_MSIZE_8         (0 << 10)
#define DMA_MSIZE_16        (1 << 10)
#define DMA_MSIZE_32        (2 << 10)
#define DMA_PSIZE_8         (0 << 8)
#define DMA_PSIZE_16        (1 << 8)
#define DMA_PSIZE_32        (2 << 8)
#define DMA_MINC            (1 << 7)
#define DMA_PINC            (1 << 6)
#define DMA_CIRC            (1 << 5)
#define DMA_DIR_FROM_MEM    (1 << 4)
#define DMA_TEIE            (1 << 3)
#define DMA_HTIE            (1 << 2)
#define DMA_TCIE            (1 << 1)
#define DMA_EN              (1 << 0)

